### 6.0. Libraries

In [70]:
import numpy as np
import pandas as pd
import re

### 6.1. Read the files

- Films

In [71]:
movie=pd.read_excel(r'C:\Users\AnjaF\Desktop\My_final_project\files\Step_5_book_into_films\Book_into_Movie.xlsx')

- bestseller books

In [72]:
book=pd.read_excel(r'C:\Users\AnjaF\Desktop\My_final_project\files\Step_4_join_the_files_bs_books_and_rating\NYT_bestseller_after_join_by_hand.xlsx')

In [73]:
movie.head()

,Unnamed: 0,index,Unnamed: 0.1,Name,Book_into_Movie
0,0,0,0.0,The Fault in Our Stars,1
1,1,1,1.0,"Divergent (Divergent, #1)",1
2,2,2,2.0,"The Maze Runner (The Maze Runner, #1)",1
3,3,3,3.0,"City of Bones (The Mortal Instruments, #1)",1
4,4,4,4.0,Gone Girl,1

In [74]:
movie = movie.drop([ "Unnamed: 0", "index", "Unnamed: 0.1"], axis=1)

In [75]:
book = book.drop([ "Unnamed: 0"], axis=1)

In [76]:
book = book.rename(columns={'Book': 'Name'})

In [77]:
book.head()

           Author        Name       Genre  Year  Rating  Reviews  Price
0  David Baldacci    Zero Day     fiction  2011     4.5   7657.0  14.67
1      Reza Aslan      Zealot  nonfiction  2013     4.4   6352.0   7.89
2     Amy Poehler  Yes Please  nonfiction  2014     4.3   4487.0  22.25
3    Nora Roberts    Year One     fiction  2017     4.6   9358.0   8.83
4     Sue Grafton           X     fiction  2015     4.4   6071.0   7.04

In [78]:
movie.head()

                                         Name  Book_into_Movie
0                      The Fault in Our Stars                1
1                   Divergent (Divergent, #1)                1
2       The Maze Runner (The Maze Runner, #1)                1
3  City of Bones (The Mortal Instruments, #1)                1
4                                   Gone Girl                1

### 6.2. Join the both files on Name

- prepariering the join()

- file: movie (in that file are written the book titles not the movie titles)

In [79]:
movie['book_name'] = [str(x).lower().strip() for x in movie['Name']]

In [80]:
movie['book_name'] = [str(x).replace('#', '') for x in movie['book_name']]

In [81]:
movie['book_name'] = [str(x).replace('(Harry Potter, 6)', '') for x in movie['book_name']]

In [82]:
movie['book_name'] = [str(x).replace('1', '') for x in movie['book_name']]

In [83]:
movie['book_name'] = [str(x).replace('2', '') for x in movie['book_name']]

In [84]:
movie['book_name'] = [str(x).replace('(', '') for x in movie['book_name']]

In [85]:
movie['book_name'] = [str(x).replace(')', '') for x in movie['book_name']]

In [86]:
movie['book_name'] = [str(x).replace('Twilight', '') for x in movie['book_name']]

In [87]:
movie['book_name'] = [str(x).replace('Hunger Games', '') for x in movie['book_name']]

- file: book

In [88]:
book['book_name'] = [str(x).lower().strip() for x in book['Name']]

In [89]:
book['book_name'] = [str(x).replace('#', '') for x in book['book_name']]

- join the files and see what happen

In [90]:
book_movie = pd.merge(book, movie[["Name","Book_into_Movie"]], on="Name", how="left")

In [91]:
book_movie.head()

,Author,Name,Genre,Year,Rating,Reviews,Price,book_name,Book_into_Movie
0,David Baldacci,Zero Day,fiction,2011,4.5,7657.0,14.67,zero day,NaN
1,Reza Aslan,Zealot,nonfiction,2013,4.4,6352.0,7.89,zealot,NaN
2,Amy Poehler,Yes Please,nonfiction,2014,4.3,4487.0,22.25,yes please,NaN
3,Nora Roberts,Year One,fiction,2017,4.6,9358.0,8.83,year one,NaN
4,Sue Grafton,X,fiction,2015,4.4,6071.0,7.04,x,NaN

In [92]:
book_movie.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 588 entries, 0 to 587
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Author           588 non-null    object
 1   Name             588 non-null    object
 2   Genre            588 non-null    object
 3   Year             588 non-null    int64
 4   Rating           588 non-null    float64
 5   Reviews          588 non-null    float64
 6   Price            588 non-null    float64
 7   book_name        588 non-null    object
 8   Book_into_Movie  26 non-null     float64
dtypes: float64(4), int64(1), object(4)
memory usage: 45.9+ KB

- only 26 movies are in the bestseller list of books for the timeline 2009 to 2021
- I check this in excel again

In [93]:
book_movie.to_excel("bestseller_books_movies.xlsx")

- result of the check in excel:
- manually -> 18 additional books into film in the list now

- a new website is found: https://apps.mymcpl.org/botb/book/browse/W
- check manually if there are books (bestseller-file) are listed